<template>
    <div class="detail">
        <div class="cover" @click="togglePlay">
            <img src="@static/images/banner.png"/>
            <img v-show="isPlaying" src="@static/images/pause.png"/>
            <img v-show="!isPlaying" src="@static/images/play.png"/>
        </div>
        <div class="content">
            <div class="collection" @click="toggleCollection">
                <img v-show="!detail.isCollect" src="@static/images/collection.png" /><img v-show="detail.isCollect" src="@static/images/collection-active.png" />喜欢
            </div>
            <div class="name">{{detail.name}}</div>
            <div class="info">
                <span>作词：{{detail.author}}</span>
                <span>作曲：{{detail.composer}}</span>
                <span>编曲：{{detail.arrangment}}</span>
            </div>
            <div class="listen">
                <div>
                    <img src="@static/images/listen.png"/>{{detail.listenCount}}
                </div>
                <div class="category-list">
                    <div v-for="(item, index) in detail.categories" :key="index" class="item">{{item}}</div>
                </div>
            </div>
            <div class="desc">
                <div>歌曲介绍</div>
                <vue-scroll class="inner" :ops="descScrollOptions">
                    {{detail.desc}}
                </vue-scroll>
            </div>
            <div class="lyric">
                <div>歌词</div>
                <vue-scroll class="inner" :ops="lyricScrollOptions">
                    {{detail.lyric}}
                </vue-scroll>
            </div>
        </div>
    </div>
</template>
<script>
    export default {
        props: {
            detail: {
                type: Object,
                default: () => {
                    return {
                        id: 1,
                        name: '打虎上山',
                        author: '黑光旭',
                        composer: '金光旭',
                        arrangment: '白光旭',
                        listenCount: 340000,
                        desc: '上一期的节目结束后，小丑也算火了一把，但是他肯定不希望是以这种方式。人们可以迅速的记住他并不是因为他的出色表现，而是真的把他当成了小丑。网上关于小丑的骂声和嘲讽很多，不少人把他做成了表情包，网友的很多留言成了我那天晚上的快乐源泉。但静下心来细细思考，我们可能每个人身上，或多或少都有小丑的影子，只是没有他那么极端。在节目上或者一些公共场合，就算你是那种性格，可能也会极大程度的收敛和克制。但小丑没有，于是就有了之后的故事。2018年的《中国新说唱》算是很艰难的一季，因为这一年说唱在被严格管控的状态下。每个人身上，或多或少都有小丑的影子，只是没有他那么极端。在节目上或者一些公共场合，就算你是那种性格，可能也会极大程度的收敛和克制。但小丑没有，于是就有了之后的故事。2018年的《中国新说唱》算是很艰难的一季，因为这一年说唱在被严格管控的状态下。每个人身上，或多或少都有小丑的影子，只是没有他那么极端。在节目上或者一些公共场合，就算你是那种性格，可能也会极大程度的收敛和克制。但小丑没有，于是就有了之后的故事。2018年的《中国新说唱》算是很艰难的一季，因为这一年说唱在被严格管控的状态下。上一期的节目结束后，小丑也算火了一把，但是他肯定不希望是以这种方式。人们可以迅速的记住他并不是因为他的出色表现，而是真的把他当成了小丑。网上关于小丑的骂声和嘲讽很多，不少人把他做成了表情包，网友的很多留言成了我那天晚上的快乐源泉。但静下心来细细思考，我们可能每个人身上，或多或少都有小丑的影子，只是没有他那么极端。在节目上或者一些公共场合，就算你是那种性格，可能也会极大程度的收敛和克制。但小丑没有，于是就有了之后的故事。2018年的《中国新说唱》算是很艰难的一季，因为这一年说唱在被严格管控的状态下。每个人身上，或多或少都有小丑的影子，只是没有他那么极端。在节目上或者一些公共场合，就算你是那种性格，可能也会极大程度的收敛和克制。但小丑没有，于是就有了之后的故事。2018年的《中国新说唱》算是很艰难的一季，因为这一年说唱在被严格管控的状态下。每个人身上，或多或少都有小丑的影子，只是没有他那么极端。在节目上或者一些公共场合，就算你是那种性格，可能也会极大程度的收敛和克制。但小丑没有，于是就有了之后的故事。2018年的《中国新说唱》算是很艰难的一季，因为这一年说唱在被严格管控的状态下。上一期的节目结束后，小丑也算火了一把，但是他肯定不希望是以这种方式。人们可以迅速的记住他并不是因为他的出色表现，而是真的把他当成了小丑。网上关于小丑的骂声和嘲讽很多，不少人把他做成了表情包，网友的很多留言成了我那天晚上的快乐源泉。但静下心来细细思考，我们可能每个人身上，或多或少都有小丑的影子，只是没有他那么极端。在节目上或者一些公共场合，就算你是那种性格，可能也会极大程度的收敛和克制。但小丑没有，于是就有了之后的故事。2018年的《中国新说唱》算是很艰难的一季，因为这一年说唱在被严格管控的状态下。每个人身上，或多或少都有小丑的影子，只是没有他那么极端。在节目上或者一些公共场合，就算你是那种性格，可能也会极大程度的收敛和克制。但小丑没有，于是就有了之后的故事。2018年的《中国新说唱》算是很艰难的一季，因为这一年说唱在被严格管控的状态下。每个人身上，或多或少都有小丑的影子，只是没有他那么极端。在节目上或者一些公共场合，就算你是那种性格，可能也会极大程度的收敛和克制。但小丑没有，于是就有了之后的故事。2018年的《中国新说唱》算是很艰难的一季，因为这一年说唱在被严格管控的状态下。',
                        lyric: '每个人身上，或多或少都有小丑的影子，只是没有他那么极端。在节目上或者一些公共场合，就算你是那种性格，可能也会极大程度的收敛和克制。但小丑没有，于是就有了之后的故事。2018年的《中国新说唱》算是很艰难的一季，因为这一年说唱在被严格管控的状态下。每个人身上，或多或少都有小丑的影子，只是没有他那么极端。在节目上或者一些公共场合，就算你是那种性格，可能也会极大程度的收敛和克制。但小丑没有，于是就有了之后的故事。2018年的《中国新说唱》算是很艰难的一季，因为这一年说唱在被严格管控的状态下。每个人身上，或多或少都有小丑的影子，只是没有他那么极端。在节目上或者一些公共场合，就算你是那种性格，可能也会极大程度的收敛和克制。但小丑没有，于是就有了之后的故事。2018年的《中国新说唱》算是很艰难的一季，因为这一年说唱在被严格管控的状态下。每个人身上，或多或少都有小丑的影子，只是没有他那么极端。在节目上或者一些公共场合，就算你是那种性格，可能也会极大程度的收敛和克制。但小丑没有，于是就有了之后的故事。2018年的《中国新说唱》算是很艰难的一季，因为这一年说唱在被严格管控的状态下。每个人身上，或多或少都有小丑的影子，只是没有他那么极端。在节目上或者一些公共场合，就算你是那种性格，可能也会极大程度的收敛和克制。但小丑没有，于是就有了之后的故事。2018年的《中国新说唱》算是很艰难的一季，因为这一年说唱在被严格管控的状态下。每个人身上，或多或少都有小丑的影子，只是没有他那么极端。在节目上或者一些公共场合，就算你是那种性格，可能也会极大程度的收敛和克制。但小丑没有，于是就有了之后的故事。2018年的《中国新说唱》算是很艰难的一季，因为这一年说唱在被严格管控的状态下。每个人身上，或多或少都有小丑的影子，只是没有他那么极端。在节目上或者一些公共场合，就算你是那种性格，可能也会极大程度的收敛和克制。但小丑没有，于是就有了之后的故事。2018年的《中国新说唱》算是很艰难的一季，因为这一年说唱在被严格管控的状态下。每个人身上，或多或少都有小丑的影子，只是没有他那么极端。在节目上或者一些公共场合，就算你是那种性格，可能也会极大程度的收敛和克制。但小丑没有，于是就有了之后的故事。2018年的《中国新说唱》算是很艰难的一季，因为这一年说唱在被严格管控的状态下。每个人身上，或多或少都有小丑的影子，只是没有他那么极端。在节目上或者一些公共场合，就算你是那种性格，可能也会极大程度的收敛和克制。但小丑没有，于是就有了之后的故事。2018年的《中国新说唱》算是很艰难的一季，因为这一年说唱在被严格管控的状态下。每个人身上，或多或少都有小丑的影子，只是没有他那么极端。在节目上或者一些公共场合，就算你是那种性格，可能也会极大程度的收敛和克制。但小丑没有，于是就有了之后的故事。2018年的《中国新说唱》算是很艰难的一季，因为这一年说唱在被严格管控的状态下。每个人身上，或多或少都有小丑的影子，只是没有他那么极端。在节目上或者一些公共场合，就算你是那种性格，可能也会极大程度的收敛和克制。但小丑没有，于是就有了之后的故事。2018年的《中国新说唱》算是很艰难的一季，因为这一年说唱在被严格管控的状态下。每个人身上，或多或少都有小丑的影子，只是没有他那么极端。在节目上或者一些公共场合，就算你是那种性格，可能也会极大程度的收敛和克制。但小丑没有，于是就有了之后的故事。2018年的《中国新说唱》算是很艰难的一季，因为这一年说唱在被严格管控的状态下。每个人身上，或多或少都有小丑的影子，只是没有他那么极端。在节目上或者一些公共场合，就算你是那种性格，可能也会极大程度的收敛和克制。但小丑没有，于是就有了之后的故事。2018年的《中国新说唱》算是很艰难的一季，因为这一年说唱在被严格管控的状态下。每个人身上，或多或少都有小丑的影子，只是没有他那么极端。在节目上或者一些公共场合，就算你是那种性格，可能也会极大程度的收敛和克制。但小丑没有，于是就有了之后的故事。2018年的《中国新说唱》算是很艰难的一季，因为这一年说唱在被严格管控的状态下。每个人身上，或多或少都有小丑的影子，只是没有他那么极端。在节目上或者一些公共场合，就算你是那种性格，可能也会极大程度的收敛和克制。但小丑没有，于是就有了之后的故事。2018年的《中国新说唱》算是很艰难的一季，因为这一年说唱在被严格管控的状态下。每个人身上，或多或少都有小丑的影子，只是没有他那么极端。在节目上或者一些公共场合，就算你是那种性格，可能也会极大程度的收敛和克制。但小丑没有，于是就有了之后的故事。2018年的《中国新说唱》算是很艰难的一季，因为这一年说唱在被严格管控的状态下。每个人身上，或多或少都有小丑的影子，只是没有他那么极端。在节目上或者一些公共场合，就算你是那种性格，可能也会极大程度的收敛和克制。但小丑没有，于是就有了之后的故事。2018年的《中国新说唱》算是很艰难的一季，因为这一年说唱在被严格管控的状态下。每个人身上，或多或少都有小丑的影子，只是没有他那么极端。在节目上或者一些公共场合，就算你是那种性格，可能也会极大程度的收敛和克制。但小丑没有，于是就有了之后的故事。2018年的《中国新说唱》算是很艰难的一季，因为这一年说唱在被严格管控的状态下。每个人身上，或多或少都有小丑的影子，只是没有他那么极端。在节目上或者一些公共场合，就算你是那种性格，可能也会极大程度的收敛和克制。但小丑没有，于是就有了之后的故事。2018年的《中国新说唱》算是很艰难的一季，因为这一年说唱在被严格管控的状态下。每个人身上，或多或少都有小丑的影子，只是没有他那么极端。在节目上或者一些公共场合，就算你是那种性格，可能也会极大程度的收敛和克制。但小丑没有，于是就有了之后的故事。2018年的《中国新说唱》算是很艰难的一季，因为这一年说唱在被严格管控的状态下。每个人身上，或多或少都有小丑的影子，只是没有他那么极端。在节目上或者一些公共场合，就算你是那种性格，可能也会极大程度的收敛和克制。但小丑没有，于是就有了之后的故事。2018年的《中国新说唱》算是很艰难的一季，因为这一年说唱在被严格管控的状态下。每个人身上，或多或少都有小丑的影子，只是没有他那么极端。在节目上或者一些公共场合，就算你是那种性格，可能也会极大程度的收敛和克制。但小丑没有，于是就有了之后的故事。2018年的《中国新说唱》算是很艰难的一季，因为这一年说唱在被严格管控的状态下。每个人身上，或多或少都有小丑的影子，只是没有他那么极端。在节目上或者一些公共场合，就算你是那种性格，可能也会极大程度的收敛和克制。但小丑没有，于是就有了之后的故事。2018年的《中国新说唱》算是很艰难的一季，因为这一年说唱在被严格管控的状态下。每个人身上，或多或少都有小丑的影子，只是没有他那么极端。在节目上或者一些公共场合，就算你是那种性格，可能也会极大程度的收敛和克制。但小丑没有，于是就有了之后的故事。2018年的《中国新说唱》算是很艰难的一季，因为这一年说唱在被严格管控的状态下。每个人身上，或多或少都有小丑的影子，只是没有他那么极端。在节目上或者一些公共场合，就算你是那种性格，可能也会极大程度的收敛和克制。但小丑没有，于是就有了之后的故事。2018年的《中国新说唱》算是很艰难的一季，因为这一年说唱在被严格管控的状态下。每个人身上，或多或少都有小丑的影子，只是没有他那么极端。在节目上或者一些公共场合，就算你是那种性格，可能也会极大程度的收敛和克制。但小丑没有，于是就有了之后的故事。2018年的《中国新说唱》算是很艰难的一季，因为这一年说唱在被严格管控的状态下。每个人身上，或多或少都有小丑的影子，只是没有他那么极端。在节目上或者一些公共场合，就算你是那种性格，可能也会极大程度的收敛和克制。但小丑没有，于是就有了之后的故事。2018年的《中国新说唱》算是很艰难的一季，因为这一年说唱在被严格管控的状态下。每个人身上，或多或少都有小丑的影子，只是没有他那么极端。在节目上或者一些公共场合，就算你是那种性格，可能也会极大程度的收敛和克制。但小丑没有，于是就有了之后的故事。2018年的《中国新说唱》算是很艰难的一季，因为这一年说唱在被严格管控的状态下。每个人身上，或多或少都有小丑的影子，只是没有他那么极端。在节目上或者一些公共场合，就算你是那种性格，可能也会极大程度的收敛和克制。但小丑没有，于是就有了之后的故事。2018年的《中国新说唱》算是很艰难的一季，因为这一年说唱在被严格管控的状态下。每个人身上，或多或少都有小丑的影子，只是没有他那么极端。在节目上或者一些公共场合，就算你是那种性格，可能也会极大程度的收敛和克制。但小丑没有，于是就有了之后的故事。2018年的《中国新说唱》算是很艰难的一季，因为这一年说唱在被严格管控的状态下。每个人身上，或多或少都有小丑的影子，只是没有他那么极端。在节目上或者一些公共场合，就算你是那种性格，可能也会极大程度的收敛和克制。但小丑没有，于是就有了之后的故事。2018年的《中国新说唱》算是很艰难的一季，因为这一年说唱在被严格管控的状态下。每个人身上，或多或少都有小丑的影子，只是没有他那么极端。在节目上或者一些公共场合，就算你是那种性格，可能也会极大程度的收敛和克制。但小丑没有，于是就有了之后的故事。2018年的《中国新说唱》算是很艰难的一季，因为这一年说唱在被严格管控的状态下。每个人身上，或多或少都有小丑的影子，只是没有他那么极端。在节目上或者一些公共场合，就算你是那种性格，可能也会极大程度的收敛和克制。但小丑没有，于是就有了之后的故事。2018年的《中国新说唱》算是很艰难的一季，因为这一年说唱在被严格管控的状态下。每个人身上，或多或少都有小丑的影子，只是没有他那么极端。在节目上或者一些公共场合，就算你是那种性格，可能也会极大程度的收敛和克制。但小丑没有，于是就有了之后的故事。2018年的《中国新说唱》算是很艰难的一季，因为这一年说唱在被严格管控的状态下。每个人身上，或多或少都有小丑的影子，只是没有他那么极端。在节目上或者一些公共场合，就算你是那种性格，可能也会极大程度的收敛和克制。但小丑没有，于是就有了之后的故事。2018年的《中国新说唱》算是很艰难的一季，因为这一年说唱在被严格管控的状态下。每个人身上，或多或少都有小丑的影子，只是没有他那么极端。在节目上或者一些公共场合，就算你是那种性格，可能也会极大程度的收敛和克制。但小丑没有，于是就有了之后的故事。2018年的《中国新说唱》算是很艰难的一季，因为这一年说唱在被严格管控的状态下。每个人身上，或多或少都有小丑的影子，只是没有他那么极端。在节目上或者一些公共场合，就算你是那种性格，可能也会极大程度的收敛和克制。但小丑没有，于是就有了之后的故事。2018年的《中国新说唱》算是很艰难的一季，因为这一年说唱在被严格管控的状态下。每个人身上，或多或少都有小丑的影子，只是没有他那么极端。在节目上或者一些公共场合，就算你是那种性格，可能也会极大程度的收敛和克制。但小丑没有，于是就有了之后的故事。2018年的《中国新说唱》算是很艰难的一季，因为这一年说唱在被严格管控的状态下。每个人身上，或多或少都有小丑的影子，只是没有他那么极端。在节目上或者一些公共场合，就算你是那种性格，可能也会极大程度的收敛和克制。但小丑没有，于是就有了之后的故事。2018年的《中国新说唱》算是很艰难的一季，因为这一年说唱在被严格管控的状态下。每个人身上，或多或少都有小丑的影子，只是没有他那么极端。在节目上或者一些公共场合，就算你是那种性格，可能也会极大程度的收敛和克制。但小丑没有，于是就有了之后的故事。2018年的《中国新说唱》算是很艰难的一季，因为这一年说唱在被严格管控的状态下。每个人身上，或多或少都有小丑的影子，只是没有他那么极端。在节目上或者一些公共场合，就算你是那种性格，可能也会极大程度的收敛和克制。但小丑没有，于是就有了之后的故事。2018年的《中国新说唱》算是很艰难的一季，因为这一年说唱在被严格管控的状态下。每个人身上，或多或少都有小丑的影子，只是没有他那么极端。在节目上或者一些公共场合，就算你是那种性格，可能也会极大程度的收敛和克制。但小丑没有，于是就有了之后的故事。2018年的《中国新说唱》算是很艰难的一季，因为这一年说唱在被严格管控的状态下。每个人身上，或多或少都有小丑的影子，只是没有他那么极端。在节目上或者一些公共场合，就算你是那种性格，可能也会极大程度的收敛和克制。但小丑没有，于是就有了之后的故事。2018年的《中国新说唱》算是很艰难的一季，因为这一年说唱在被严格管控的状态下。每个人身上，或多或少都有小丑的影子，只是没有他那么极端。在节目上或者一些公共场合，就算你是那种性格，可能也会极大程度的收敛和克制。但小丑没有，于是就有了之后的故事。2018年的《中国新说唱》算是很艰难的一季，因为这一年说唱在被严格管控的状态下。每个人身上，或多或少都有小丑的影子，只是没有他那么极端。在节目上或者一些公共场合，就算你是那种性格，可能也会极大程度的收敛和克制。但小丑没有，于是就有了之后的故事。2018年的《中国新说唱》算是很艰难的一季，因为这一年说唱在被严格管控的状态下。每个人身上，或多或少都有小丑的影子，只是没有他那么极端。在节目上或者一些公共场合，就算你是那种性格，可能也会极大程度的收敛和克制。但小丑没有，于是就有了之后的故事。2018年的《中国新说唱》算是很艰难的一季，因为这一年说唱在被严格管控的状态下。每个人身上，或多或少都有小丑的影子，只是没有他那么极端。在节目上或者一些公共场合，就算你是那种性格，可能也会极大程度的收敛和克制。但小丑没有，于是就有了之后的故事。2018年的《中国新说唱》算是很艰难的一季，因为这一年说唱在被严格管控的状态下。每个人身上，或多或少都有小丑的影子，只是没有他那么极端。在节目上或者一些公共场合，就算你是那种性格，可能也会极大程度的收敛和克制。但小丑没有，于是就有了之后的故事。2018年的《中国新说唱》算是很艰难的一季，因为这一年说唱在被严格管控的状态下。每个人身上，或多或少都有小丑的影子，只是没有他那么极端。在节目上或者一些公共场合，就算你是那种性格，可能也会极大程度的收敛和克制。但小丑没有，于是就有了之后的故事。2018年的《中国新说唱》算是很艰难的一季，因为这一年说唱在被严格管控的状态下。每个人身上，或多或少都有小丑的影子，只是没有他那么极端。在节目上或者一些公共场合，就算你是那种性格，可能也会极大程度的收敛和克制。但小丑没有，于是就有了之后的故事。2018年的《中国新说唱》算是很艰难的一季，因为这一年说唱在被严格管控的状态下。',
                        categories: ['Old school', 'Logic Pro'],
                        isCollect: true
                    }
                }
            }
        },
        data() {
            return {
                isPlaying: false,
                descScrollOptions: {
                    bar: {
                      keepShow: true,
                      background: '#EAEAEA'
                    },
                    scrollPanel: {
                      scrollingX: false
                    }
                },
                lyricScrollOptions: {
                    bar: {
                      keepShow: true,
                      background: '#EAEAEA'
                    },
                    scrollPanel: {
                      scrollingX: false
                    }
                }
            }
        },
        methods: {
            togglePlay() {
                this.isPlaying = !this.isPlaying
            },
            toggleCollection() {
                let detail = this.detail
                let isCollect = detail.isCollect
                detail.isCollect = !isCollect
            }
        }
    }
</script>
<style lang="less" scoped>
    .mt10 {margin-top: 10px;}
    .detail {
        display: flex;
        flex: 1;
        background: #fff;
        padding: 30px 30px 45px;
        .cover {
            width: 230px;
            height: 230px;
            margin-right: 30px;
            position: relative;
            cursor: pointer;
            &:before {
                content: '';
                position: absolute;
                top: 0;
                right: 0;
                bottom: 0;
                left: 0;
                background: rgba(0, 0, 0, .1);
            }
            img {
                &:first-child {
                    width: 230px;
                    height: 230px;
                }
                &:not(:first-child) {
                    width: 82px;
                    height: 82px;
                    position: absolute;
                    top: 50%;
                    left: 50%;
                    transform: translate(-50%, -50%);
                }
            }
        }
        .content {
            flex: 1;
            position: relative;
            .collection {
                position: absolute;
                top: 0;
                right: 0;
                width:100px;
                line-height:40px;
                background:rgba(255,255,255,1);
                border:1px solid rgba(226,226,226,1);
                cursor: pointer;
                padding: 0 0 0 47px;
                img {
                    position: absolute;
                    top: 50%;
                    left: 15px;
                    transform: translateY(-50%);
                }
            }
            .name {
                width: 500px;
                text-overflow: ellipsis;
                overflow: hidden;
                white-space: nowrap;
                font-size:18px;
                font-family:PingFangSC-Semibold;
                font-weight:600;
                color:rgba(16,16,16,1);
                line-height:25px;
            }
            .info {
                margin-top: 10px;
                font-size:14px;
                font-family:PingFangSC-Light;
                font-weight:300;
                color:rgba(16,16,16,1);
                line-height:20px;
                span {
                    &:not(:first-child) {
                        margin-left: 24px;
                    }
                }
            }
            .listen {
                margin-top: 10px;
                display: flex;
                > div {
                    &:first-child {
                        line-height: 28px;
                        font-size:14px;
                        font-family:PingFangSC-Light;
                        font-weight:300;
                        color:rgba(16,16,16,1);
                        display: inline-block;
                        position: relative;
                        padding: 0 0 0 21px;
                        img {
                            position: absolute;
                            left: -5px;
                            top: 50%;
                            transform: translateY(-50%);
                        }
                    }
                }
                .category-list {
                    margin-left: 20px;
                    flex: 1;
                    .item {
                        display: inline-block;
                        min-width: 86px;
                        padding: 0 13px;
                        line-height: 26px;
                        background:rgba(255,255,255,1);
                        border-radius:3px;
                        border:1px solid rgba(226,226,226,1);
                        font-size:12px;
                        font-family:PingFangSC-Light;
                        font-weight:300;
                        color:rgba(16,16,16,1);
                        &:not(:first-child) {
                            margin-left: 10px;
                        }
                    }
                }
            }
            .desc {
                margin-top: 10px;
                > div {
                    &:first-child {
                        font-size:16px;
                        font-family:PingFangSC-Semibold;
                        font-weight:600;
                        color:rgba(16,16,16,1);
                        line-height:22px;
                    }
                }
                .inner {
                    height: 160px !important;
                    margin-top: 16px;
                    font-size:14px;
                    font-family:PingFangSC-Regular;
                    font-weight:400;
                    color:rgba(16,16,16,1);
                    line-height:20px;
                }
            }
            .lyric {
                margin-top: 40px;
                > div {
                    &:first-child {
                        font-size:16px;
                        font-family:PingFangSC-Semibold;
                        font-weight:600;
                        color:rgba(16,16,16,1);
                        line-height:22px;
                    }
                }
                .inner {
                    margin-top: 14px;
                    height: 330px !important;
                    font-size:14px;
                    font-family:PingFangSC-Regular;
                    font-weight:400;
                    color:rgba(16,16,16,1);
                    line-height:20px;
                }
            }
        }
    }
</style>